#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.main_hosting.azurerm_resource_group.default[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech]
module.main_hosting.data.azurerm_subscription.current: Reading...
module.main_hosting.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89]
module.main_hosting.azurerm_virtual_network.default[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Network/virtualNetworks/s190d01-plantechdefault]
module.main_hosting.azurerm_container_registry.acr[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.ContainerRegistry/registries/s190d01plantech]
module.main_hosting.azurerm_log_analytics_workspace.container_app: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.OperationalInsights/workspaces/s190d01-plantechcontainerapp]
module.main_hosting.azurerm_cdn_frontdoor_profile.cdn[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Cdn/profiles/s190d01-plantechcdn]
module.main_hosting.azurerm_route_table.default[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Network/routeTables/s190d01-plantechdefault]
module.main_hosting.azurerm_log_analytics_query_pack.container_app: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.OperationalInsights/queryPacks/s190d01-plantechcontainerapp]
module.main_hosting.azurerm_cdn_frontdoor_origin_group.group[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Cdn/profiles/s190d01-plantechcdn/originGroups/s190d01-plantechorigingroup]
module.main_hosting.azurerm_cdn_frontdoor_endpoint.endpoint[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Cdn/profiles/s190d01-plantechcdn/afdEndpoints/s190d01-plantechcdnendpoint]
module.main_hosting.azurerm_subnet.container_apps_infra_subnet[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Network/virtualNetworks/s190d01-plantechdefault/subnets/s190d01-plantechcontainerappsinfra]
module.main_hosting.azurerm_subnet_route_table_association.container_apps_infra_subnet[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Network/virtualNetworks/s190d01-plantechdefault/subnets/s190d01-plantechcontainerappsinfra]
module.main_hosting.azapi_resource.container_app_env: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.App/managedEnvironments/s190d01-plantechcontainerapp]
module.main_hosting.azurerm_application_insights.main: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Insights/components/s190d01-plantech-insights]
module.main_hosting.azurerm_monitor_diagnostic_setting.cdn[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Cdn/profiles/s190d01-plantechcdn|s190d01-plantechcdn]
module.main_hosting.azurerm_network_security_group.container_apps_infra_allow_frontdoor_inbound_only[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Network/networkSecurityGroups/s190d01-plantechcontainerappsinfransg]
module.main_hosting.null_resource.tagging: Refreshing state... [id=6164265562042276349]
module.main_hosting.azurerm_subnet_network_security_group_association.container_apps_infra_allow_frontdoor_inbound_only[0]: Refreshing state... [id=/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Network/virtualNetworks/s190d01-plantechdefault/subnets/s190d01-plantechcontainerappsinfra]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.main_hosting.azapi_resource.default will be created
  + resource "azapi_resource" "default" {
      + body                      = (sensitive value)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "westeurope"
      + name                      = "s190d01-plantech-plan-tech-app"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech"
      + removing_special_chars    = false
      + response_export_values    = [
          + "properties.outboundIpAddresses",
          + "properties.configuration.ingress.fqdn",
        ]
      + schema_validation_enabled = true
      + tags                      = {
          + "Environment"      = "Dev"
          + "Product"          = "Plan Technology for your School"
          + "Service Offering" = "Plan Technology for your School"
        }
      + type                      = "Microsoft.App/containerApps@2022-03-01"
    }

  # module.main_hosting.azurerm_cdn_frontdoor_origin.origin[0] will be created
  + resource "azurerm_cdn_frontdoor_origin" "origin" {
      + cdn_frontdoor_origin_group_id  = "/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Cdn/profiles/s190d01-plantechcdn/originGroups/s190d01-plantechorigingroup"
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "s190d01-plantechorigin"
      + priority                       = 1
      + weight                         = 500
    }

  # module.main_hosting.azurerm_cdn_frontdoor_route.route[0] will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = "/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Cdn/profiles/s190d01-plantechcdn/afdEndpoints/s190d01-plantechcdnendpoint"
      + cdn_frontdoor_origin_group_id = "/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Cdn/profiles/s190d01-plantechcdn/originGroups/s190d01-plantechorigingroup"
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "s190d01-plantechroute"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.main_hosting.azurerm_monitor_diagnostic_setting.cdn[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "cdn" {
        id                             = "/subscriptions/01ca3b42-9780-4628-806b-79279e3c7e89/resourceGroups/s190d01-plantech/providers/Microsoft.Cdn/profiles/s190d01-plantechcdn|s190d01-plantechcdn"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "s190d01-plantechcdn"
        # (2 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.main_hosting.null_resource.tagging is tainted, so must be replaced
-/+ resource "null_resource" "tagging" {
      ~ id       = "6164265562042276349" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @PeterShipstoneAND, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform PR Check`*